espressif/esp-idf/tools/test_apps/system/panic/panic_base/sdkconfig.ci.memprot_esp32h2
# Restricting to ESP32H2
CONFIG_IDF_TARGET="esp32h2"

# Enabling memory protection
CONFIG_ESP_SYSTEM_MEMPROT=y

# Enable memprot test
CONFIG_TEST_MEMPROT=y
